/* Pадание 3: Напишите о четырёх ценностях, которые есть в манифесте Agile
1) Люди и взаимодействие важнее процессов и инструментов
>> Живое общение в команде может эффективнее влиять на процесс разработки, чем неукоснительное следование правилам и формализации всех сопутствующих процессов в ходе работы над проектом

2) Работающий продукт важнее исчерпывающей документации
>> Стоит отойти от беспрекословного выполнения технического задания и соблюдения прочей документации, которую принято составлять для проекта ради проявления инициативы членов команды по упрощению разработки с получением аналогичного или лучшего результата. Следствием этого может стать интуитивно понятный для пользователя продукт, инструкция к которому не понадобится.

 3) Сотрудничество с заказчиком важнее согласования условий контракта
>> Здесь подразумевается выстраивание хороших отношений с заказчиком еще до подписания документов, чтобы при возникновении каких-либо проблем сохранить человеческое отношение друг к другу, а не лаяться между собой и бежать в суд ради "восторжествования справедливости". Стоит помнить, что мы все в одной лодке, хоть и каждый из нас живет в своём мире.

 4) Готовность к изменениям важнее следования первоначальному плану
>> Помните, что будущее непредсказуемо и завтра может произойти всё что угодно, поэтому при возникновении эксцессов стоит действовать по ситуации, а не готовиться ко всему заранее. Первоначальный план может стать помощником, а не конечной точкой. А также следует помнить, что все внезапные идеи допустимы к рассмотрению и не стоит их откладывать в долгий ящик, т.к. они могут привести к невероятному успеху.
*/

/*
 Задание 4: У кажите минимум три отличия фреймворка Scrum от Kanban.
 1) в длине итераций. В Scrum итерации — 2 недели, в Kanban задачи программисту можно «подсовывать» хоть каждый день.
 2) В Scrum наша цель — закончить спринт, в Kanban — задачу.
 3) В Kanban не принято делать оценку. В Scrum задачи принято оценивать в Story points или в часах.
 */

/*
 заданние 5: Опишите процесс работы по Scrum
 Основой Scrum является Sprint, в течении которого выполняется работа над продуктом. По окончанию Sprint должна быть получена новая рабочая версия продукта.
 Sprint всегда ограничен по времени (1-4 недели) и имеет одинаковую продолжительность на протяжении всей жизни продукта.
 Перед началом каждого Sprint производится Sprint Planning. Каждый день производится Daily Scrum. По окончанию Sprint'а производятся Sprint Review и Sprint Retrospective.
 */


